Revit 2027 API
StructuralConnectionApprovalType.IsValidApprovalTypeName Method
 Verifies if the provided approval name is unique in the document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidApprovalTypeName(
	Document doc,
	string name
)
Public Shared Function IsValidApprovalTypeName (
	doc As Document,
	name As String
) As Boolean
public:
static bool IsValidApprovalTypeName(
	Document^ doc,
	String^ name
)
static member IsValidApprovalTypeName :
        doc : Document *
        name : string -> bool
Parameters
doc Document
name String
Return Value
Boolean
 True if approval type name is unique.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace